cmsis-svd/cmsis-svd/data/Infineon/s6e2h4xe.svd
        <!-- REGISTER "IRQ024MON" -->
        <register>
          <name>IRQ024MON</name>
          <description>IRQ024 Batch Read Register</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FRT_PEAK_INT2" -->
            <field>
              <name>FRT_PEAK_INT2</name>
              <description>FRT ch.2 peak value detection interrupt request of the MFT unit 0</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT_PEAK_INT1" -->
            <field>
              <name>FRT_PEAK_INT1</name>
              <description>FRT ch.1 peak value detection interrupt request of the MFT unit 0</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT_PEAK_INT0" -->
            <field>
              <name>FRT_PEAK_INT0</name>
              <description>FRT ch.0 peak value detection interrupt request of the MFT unit 0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ025MON" -->
        <register>
          <name>IRQ025MON</name>
          <description>IRQ025 Batch Read Register</description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FRT_ZERO_INT2" -->
            <field>
              <name>FRT_ZERO_INT2</name>
              <description>FRT ch.2 zero detection interrupt request of the MFT unit 0</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT_ZERO_INT1" -->
            <field>
              <name>FRT_ZERO_INT1</name>
              <description>FRT ch.1 zero detection interrupt request of the MFT unit 0</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT_ZERO_INT0" -->
            <field>
              <name>FRT_ZERO_INT0</name>
              <description>FRT ch.0 zero detection interrupt request of the MFT unit 0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ026MON" -->
        <register>
          <name>IRQ026MON</name>
          <description>IRQ026 Batch Read Register</description>
          <addressOffset>0x26C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ICUINT3" -->
            <field>
              <name>ICUINT3</name>
              <description>ICU ch.3 input edge detection interrupt request of the MFT unit 0</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICUINT2" -->
            <field>
              <name>ICUINT2</name>
              <description>ICU ch.2 input edge detection interrupt request of the MFT unit 0</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICUINT1" -->
            <field>
              <name>ICUINT1</name>
              <description>ICU ch.1 input edge detection interrupt request of the MFT unit 0</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICUINT0" -->
            <field>
              <name>ICUINT0</name>
              <description>ICU ch.0 input edge detection interrupt request of the MFT unit 0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ027MON" -->
        <register>
          <name>IRQ027MON</name>
          <description>IRQ027 Batch Read Register</description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "OCUINT5" -->
            <field>
              <name>OCUINT5</name>
              <description>OCU ch.5 match detection interrupt request of the MFT unit 0</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCUINT4" -->
            <field>
              <name>OCUINT4</name>
              <description>OCU ch.4 match detection interrupt request of the MFT unit 0</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCUINT3" -->
            <field>
              <name>OCUINT3</name>
              <description>OCU ch.3 match detection interrupt request of the MFT unit 0</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCUINT2" -->
            <field>
              <name>OCUINT2</name>
              <description>OCU ch.2 match detection interrupt request of the MFT unit 0</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCUINT1" -->
            <field>
              <name>OCUINT1</name>
              <description>OCU ch.1 match detection interrupt request of the MFT unit 0</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCUINT0" -->
            <field>
              <name>OCUINT0</name>
              <description>OCU ch.0 match detection interrupt request of the MFT unit 0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
