cmsis-svd/cmsis-svd/data/Infineon/s6e2h4xe.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "MFS1" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS1</name>
      <baseAddress>0x40038100</baseAddress>
      <description>Multi-function Serial Interface 1</description>
      <version>A</version>
      <!-- INTERRUPT "MFS1_RX" -->
      <interrupt>
        <name>MFS1_RX</name>
        <value>62</value>
      </interrupt>
      <!-- INTERRUPT "MFS1_TX" -->
      <interrupt>
        <name>MFS1_TX</name>
        <value>63</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS2" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS2</name>
      <baseAddress>0x40038200</baseAddress>
      <description>Multi-function Serial Interface 2</description>
      <version>A</version>
      <!-- INTERRUPT "MFS2_RX" -->
      <interrupt>
        <name>MFS2_RX</name>
        <value>64</value>
      </interrupt>
      <!-- INTERRUPT "MFS2_TX" -->
      <interrupt>
        <name>MFS2_TX</name>
        <value>65</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS3" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS3</name>
      <baseAddress>0x40038300</baseAddress>
      <description>Multi-function Serial Interface 3</description>
      <version>A</version>
      <!-- INTERRUPT "MFS3_RX" -->
      <interrupt>
        <name>MFS3_RX</name>
        <value>66</value>
      </interrupt>
      <!-- INTERRUPT "MFS3_TX" -->
      <interrupt>
        <name>MFS3_TX</name>
        <value>67</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS4" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS4</name>
      <baseAddress>0x40038400</baseAddress>
      <description>Multi-function Serial Interface 4</description>
      <version>A</version>
      <!-- INTERRUPT "MFS4_RX" -->
      <interrupt>
        <name>MFS4_RX</name>
        <value>68</value>
      </interrupt>
      <!-- INTERRUPT "MFS4_TX" -->
      <interrupt>
        <name>MFS4_TX</name>
        <value>69</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS5" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS5</name>
      <baseAddress>0x40038500</baseAddress>
      <description>Multi-function Serial Interface 5</description>
      <version>A</version>
      <!-- INTERRUPT "MFS5_RX" -->
      <interrupt>
        <name>MFS5_RX</name>
        <value>70</value>
      </interrupt>
      <!-- INTERRUPT "MFS5_TX" -->
      <interrupt>
        <name>MFS5_TX</name>
        <value>71</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS6" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS6</name>
      <baseAddress>0x40038600</baseAddress>
      <description>Multi-function Serial Interface 6</description>
      <version>A</version>
      <!-- INTERRUPT "MFS6_RX" -->
      <interrupt>
        <name>MFS6_RX</name>
        <value>72</value>
      </interrupt>
      <!-- INTERRUPT "MFS6_TX" -->
      <interrupt>
        <name>MFS6_TX</name>
        <value>73</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS7" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS7</name>
      <baseAddress>0x40038700</baseAddress>
      <description>Multi-function Serial Interface 7</description>
      <version>A</version>
      <!-- INTERRUPT "MFS7_RX" -->
      <interrupt>
        <name>MFS7_RX</name>
        <value>74</value>
      </interrupt>
      <!-- INTERRUPT "MFS7_TX" -->
      <interrupt>
        <name>MFS7_TX</name>
        <value>75</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "CRC" -->
    <peripheral>
      <name>CRC</name>
      <description>CRC Registers</description>
      <version>A</version>
      <groupName>CRC</groupName>
      <baseAddress>0x40039000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "CRCCR" -->
        <register>
          <name>CRCCR</name>
          <description>CRC Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FXOR" -->
            <field>
              <name>FXOR</name>
              <description>Initialization bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRCLSF" -->
            <field>
              <name>CRCLSF</name>
              <description>Final XOR control bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRCLTE" -->
            <field>
              <name>CRCLTE</name>
              <description>CRC result bit-order setting bit </description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LSBFST" -->
            <field>
              <name>LSBFST</name>
              <description>CRC result byte-order setting bit </description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LTLEND" -->
            <field>
              <name>LTLEND</name>
              <description>Bit-order setting bit </description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRC32" -->
            <field>
              <name>CRC32</name>
              <description>Byte-order setting bit </description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INIT" -->
            <field>
              <name>INIT</name>
              <description>CRC mode selection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CRCINIT" -->
        <register>
          <name>CRCINIT</name>
          <description>Initial Value Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "D" -->
            <field>
              <name>D</name>
              <description>Initial value</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CRCIN" -->
        <register>
          <name>CRCIN</name>
          <description>Input Data Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "D" -->
            <field>
              <name>D</name>
              <description>Input data</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CRCR" -->
        <register>
          <name>CRCR</name>
          <description>CRC Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "D" -->
            <field>
              <name>D</name>
              <description>CRC Data</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
